name: "vit_trt"
backend: "tensorrt"

input [
    {
        name: "tokens"
        data_type: TYPE_FP32
        dims: [ -1, -1, -1, -1 ]
    }
]

output [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ -1, 1000 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]
