name: "clip_trt"
backend: "python"

input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [ -1, -1, -1, -1 ]
    },
    {
        name: "texts"
        data_type: TYPE_STRING
        dims: [ -1 , -1 ]
    }
]

output [
    {
        name: "text_probs"
        data_type: TYPE_FP32
        dims: [ -1, -1 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]
