name: "nsfw_trt"
backend: "tensorrt"

input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [ -1, 3, 224, 224 ]
    }
]

output [
    {
        name: "nsfw_probs"
        data_type: TYPE_FP32
        dims: [ -1, 1 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]
